Revit 2025 API
StonePatternType Enumeration
 The enumerated type representing the permitted values for the asset property "StonePattern" from the "Stone" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum StonePatternType
Public Enumeration StonePatternType
public enum class StonePatternType
type StonePatternType
Members
Member name | Value | Description
None | 0
Custom | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace